Repository: TowardsIkhlaas/simply_qibla
Catalog: lib/l10n/app_*.arb
Languages: ar, de, fr, id, ms, pt_pt

# appNamePascalCase
source: SimplyQibla
ar: سمبلي قبلة

# appAboutLegalese
source: Â© 2024 TowardsIkhlaas
ar: © ٢٠٢٤ TowardsIkhlaas
de: © 2024 TowardsIkhlaas
fr: © 2024 TowardsIkhlaas
pt_pt: © 2024 TowardsIkhlaas

# changeLocationBarText
source: Jump to a specific location? :)
ar: الانتقال إلى موقع محدد؟ :)
de: Zu einem bestimmten Ort springen? :)
fr: Aller à un lieu spécifique ? :)
id: Ingin langsung ke lokasi tertentu? :)
ms: Mahu pergi ke lokasi tertentu? :)
pt_pt: Ir para uma localização específica? :)

# latitudeFieldLabel
source: Latitude
ar: (أرقام 0-9) خط العرض
de: Breitengrad
id: Lintang
ms: Latitud

# longitudeFieldLabel
source: Longitude
ar: (أرقام 0-9) خط الطول
de: Längengrad
id: Bujur
ms: Longitud

# skipText
source: Skip
ar: تخطي
de: Überspringen
fr: Ignorer
id: Lewati
ms: Langkau
pt_pt: Saltar

# doneText
source: Done
ar: تم
de: Fertig
fr: Terminé
id: Selesai
ms: Selesai
pt_pt: Concluído

# okText
source: OK
ar: حسنا

# cancelText
source: Cancel
ar: إلغاء
de: Abbrechen
fr: Annuler
id: Batal
ms: Batal
pt_pt: Cancelar

# clearText
source: Clear
ar: مسح
de: Löschen
fr: Effacer
id: Hapus
ms: Kosongkan
pt_pt: Limpar

# allowText
source: ALLOW
ar: يسمح
de: ZULASSEN
fr: AUTORISER
id: IZINKAN
ms: IZINKAN
pt_pt: PERMITIR

# turnOnText
source: TURN ON
ar: تشغيل
de: AKTIVIEREN
fr: ACTIVER
id: NYALAKAN
ms: HIDUPKAN
pt_pt: LIGAR

# coordinatesInputFormTitle
source: Enter Coordinates
ar: أدخل الإحداثيات
de: Koordinaten eingeben
fr: Entrer les coordonnées
id: Masukkan Koordinat
ms: Masukkan Koordinat
pt_pt: Introduzir Coordenadas

# centerConsoleCenteringText
source: Locating you...
ar: جارٍ تحديد موقعك...
de: Standort wird ermittelt...
fr: Localisation en cours...
id: Mencari lokasi Anda...
ms: Mencari lokasi anda...
pt_pt: A localizar...

# centerConsoleDraggingText
source: Lift to show Qibla line
ar: ارفع لإظهار خط القبلة
de: Anheben, um die Qibla-Linie anzuzeigen
fr: Soulevez pour afficher la ligne de Qibla
id: Angkat untuk menampilkan garis kiblat
ms: Angkat untuk tunjukkan garis Qibla
pt_pt: Levante para mostrar a linha da Qibla

# centerConsoleIdleText
source: km to the Kaaba
ar: كم إلى الكعبة
de: km bis zur Kaaba
fr: km jusqu'à la Kaaba
id: km ke Ka'bah
ms: km ke Kaabah
pt_pt: km até à Kaaba

# locationDisabled
source: Your location is off.
ar: تم تعطيل الموقعك.
de: Ihr Standort ist deaktiviert.
fr: Votre localisation est désactivée.
id: Layanan lokasi Anda dinonaktifkan.
ms: Lokasi anda dimatikan.
pt_pt: A sua localização está desativada.

# locationDeniedInitial
source: Please allow location permission to use this feature. We do not store or sell your data. :)
ar: يرجى السماح بإذن الموقع لاستخدام هذه الميزة. نحن لا نخزن أو نبيع بياناتك. :)
de: Bitte erlauben Sie die Standortberechtigung, um diese Funktion zu nutzen. Wir speichern oder verkaufen Ihre Daten nicht. :)
fr: Veuillez autoriser la permission de localisation pour utiliser cette fonctionnalité. Nous ne stockons ni ne vendons vos données. :)
id: Silakan izinkan akses lokasi untuk menggunakan fitur ini. Kami tidak menyimpan atau menjual data Anda. :)
ms: Sila benarkan kebenaran lokasi untuk menggunakan ciri ini. Kami tidak menyimpan atau menjual data anda. :)
pt_pt: Por favor, permita a permissão de localização para usar esta funcionalidade. Não guardamos nem vendemos os seus dados. :)

# locationDeniedPermanent
source: Please allow location permission to use this feature.
ar: يرجى السماح بإذن الموقعك لاستخدام هذه الميزة.
de: Bitte erlauben Sie die Standortberechtigung, um diese Funktion zu nutzen.
fr: Veuillez autoriser la permission de localisation pour utiliser cette fonctionnalité.
id: Silakan izinkan akses lokasi untuk menggunakan fitur ini.
ms: Sila benarkan kebenaran lokasi untuk menggunakan ciri ini.
pt_pt: Por favor, permita a permissão de localização para usar esta funcionalidade.

# latitudeErrorText
source: Invalid latitude value
ar: قيمة خط العرض غير صالحة
de: Ungültiger Breitengrad-Wert
fr: Valeur de latitude invalide
id: Nilai lintang tidak valid
ms: Nilai latitud tidak sah
pt_pt: Valor de latitude inválido

# longitudeErrorText
source: Invalid longitude value
ar: قيمة خط الطول غير صالحة
de: Ungültiger Längengrad-Wert
fr: Valeur de longitude invalide
id: Nilai bujur tidak valid
ms: Nilai longitud tidak sah
pt_pt: Valor de longitude inválido

# thankYouText
source: JazakAllahu Khayran for using this app!
ar: جزاك الله خيرًا لاستخدامك هذا التطبيق!
de: JazakAllahu Khayran für die Nutzung dieser App!
fr: JazakAllahu Khayran d'utiliser cette application !
id: JazakAllahu Khayran telah menggunakan aplikasi ini!
ms: JazakAllahu Khayran kerana menggunakan aplikasi ini!
pt_pt: JazakAllahu Khayran por usar esta aplicação!

# supportAppealText
source: This app costs to run and maintain (Google Maps API). Please consider supporting the project through the buttons below (excess amounts will be donated to registered charities).
ar: يتطلب تشغيل هذا التطبيق وصيانته (Google Maps API). يرجى النظر في دعم المشروع من خلال الأزرار أدناه (سيتم التبرع بالمبالغ الزائدة للجمعيات الخيرية المسجلة).
de: Diese App verursacht Kosten für Betrieb und Wartung (Google Maps API). Bitte unterstützen Sie das Projekt über die untenstehenden Buttons (überschüssige Beträge werden an registrierte Wohltätigkeitsorganisationen gespendet).
fr: Cette application a des coûts de fonctionnement et de maintenance (API Google Maps). Veuillez envisager de soutenir le projet via les boutons ci-dessous (les montants excédentaires seront donnés à des associations caritatives enregistrées).
id: Aplikasi ini memerlukan biaya untuk dijalankan dan dipelihara (Google Maps API). Mohon pertimbangkan untuk mendukung proyek ini melalui tombol di bawah (dana lebih akan disumbangkan ke badan amal terdaftar).
ms: Aplikasi ini memerlukan kos untuk dijalankan dan diselenggara (Google Maps API). Sila pertimbangkan untuk menyokong projek ini melalui butang di bawah (lebih jumlah akan disumbangkan kepada badan amal berdaftar).
pt_pt: Esta aplicação tem custos de funcionamento e manutenção (Google Maps API). Considere apoiar o projeto através dos botões abaixo (valores excedentes serão doados a instituições de caridade registadas).

# githubButtonText
source: Support us on GitHub
ar: ادعمنا على GitHub
de: Support auf GitHub
fr: Soutenez-nous sur GitHub
id: Dukung kami di GitHub
ms: Sokong kami di GitHub
pt_pt: Apoie-nos no GitHub

# donateButtonText
source: Support us on Ko-Fi
ar: ادعمنا على Ko-Fi
de: Support auf Ko-Fi
fr: Soutenez-nous sur Ko-Fi
id: Dukung kami di Ko-Fi
ms: Sokong kami di Ko-Fi
pt_pt: Apoie-nos no Ko-Fi

# socialInstagramButtonText
source: Follow us on Instagram
ar: تابعنا على Instagram
de: Folgen Sie uns auf Instagram
fr: Suivez-nous sur Instagram
id: Ikuti kami di Instagram
ms: Ikuti kami di Instagram
pt_pt: Siga-nos no Instagram

# shareButtonText
source: Share with Friends
ar: شارك مع الأصدقاء
de: Mit Freunden teilen
fr: Partager avec des amis
id: Bagikan dengan Teman
ms: Kongsi dengan Rakan
pt_pt: Partilhar com Amigos

# shareContentText
source: As salaam alaykum warahmatullahi wabarakatuh! Check out this beautiful and accurate Qibla app
ar: السلام عليكم ورحمة الله وبركاته! تحقق من هذا التطبيق الجميل والدقيق لتحديد القبلة
de: As-salamu alaykum wa rahmatullahi wa barakatuh! Schau dir diese schöne und genaue Qibla-App an
fr: As salam alaykum warahmatullahi wabarakatuh ! Découvrez cette belle application de Qibla, précise et pratique.
id: Assalamualaikum warahmatullahi wabarakatuh! Coba aplikasi kiblat yang indah dan akurat ini
ms: As salaam alaykum warahmatullahi wabarakatuh! Lihat aplikasi Qibla yang indah dan tepat ini
pt_pt: As salaam alaykum warahmatullahi wabarakatuh! Veja esta aplicação Qibla bonita e precisa

# onboardingUsageTitle
source: How does this work?
ar: كيف يعمل هذا؟
de: Wie funktioniert das?
fr: Comment ça marche ?
id: Bagaimana ini bekerja?
ms: Bagaimana ia berfungsi?
pt_pt: Como funciona?

# onboardingLocationTitle
source: Let the app find you.
ar: دع التطبيق يجد موقعك.
de: Lassen Sie die App Ihren Standort finden.
fr: Laissez l'application vous localiser.
id: Biarkan aplikasi menemukan Anda.
ms: Biarkan aplikasi mencari anda.
pt_pt: Deixe a aplicação encontrar a sua localização.

# onboardingSupportTitle
source: Support our mission!
ar: ادعم مهمتنا!
de: Unterstützen Sie unsere Mission!
fr: Soutenez notre mission !
id: Dukung misi kami!
ms: Sokong misi kami!
pt_pt: Apoie a nossa missão!

# onboardingUsageBody
source: Salaam! To use the app, hold your device flat and rotate it to align with nearby landmarks shown in the map, like streets and buildings around you.
ar: السلام عليكم! لاستخدام التطبيق، ضع جهازك بشكل مسطح وقم بتدويره ليصطف مع المعالم القريبة المعروضة في الخريطة، مثل الشوارع والمباني من حولك.
de: Salaam! Um die App zu nutzen, halten Sie Ihr Gerät flach und drehen Sie es, um sich an nahegelegenen Orientierungspunkten auf der Karte auszurichten, wie Straßen und Gebäuden in Ihrer Umgebung.
fr: Salaam ! Pour utiliser l'application, tenez votre appareil à plat et faites-le pivoter pour l'aligner avec les points de repère proches affichés sur la carte, tels que les rues et les bâtiments autour de vous.
id: Salaam! Untuk menggunakan aplikasi, pegang perangkat Anda dalam posisi datar dan putar untuk menyelaraskan dengan landmark di peta, seperti jalan dan bangunan di sekitar Anda.
ms: Salaam! Untuk menggunakan aplikasi ini, pegang peranti anda secara mendatar dan pusingkan untuk menyelaraskan dengan mercu tanda berhampiran yang ditunjukkan pada peta, seperti jalan dan bangunan di sekitar anda.
pt_pt: Salaam! Para usar a aplicação, mantenha o dispositivo plano e rode-o para alinhar com os pontos de referência no mapa, como ruas e edifícios ao seu redor.

# onboardingLocationBody
source: Location permissions are needed for the app to function ideally, but not required. Rest assured, your data is neither collected nor sold.
ar: تعد أذونات الموقع ضرورية لكي يعمل التطبيق بشكل مثالي، ولكنها ليست إلزامية. كن مطمئنًا، بياناتك لن يتم جمعها أو بيعها.
de: Standortberechtigungen sind notwendig, damit die App optimal funktioniert, aber nicht zwingend erforderlich. Seien Sie versichert, Ihre Daten werden weder gesammelt noch verkauft.
fr: Les autorisations de localisation sont nécessaires pour que l'application fonctionne de manière optimale, mais ne sont pas obligatoires. Soyez rassurés, vos données ne sont ni collectées ni vendues.
id: Izin lokasi diperlukan agar aplikasi berfungsi dengan optimal, tetapi tidak wajib. Tenang, data Anda tidak dikumpulkan atau dijual.
ms: Kebenaran lokasi diperlukan agar aplikasi berfungsi dengan optimum, tetapi tidak wajib. Anda yakin, data anda tidak dikumpul atau dijual.
pt_pt: As permissões de localização são necessárias para o funcionamento ideal da aplicação, mas não obrigatórias. Garantimos que os seus dados não são recolhidos nem vendidos.

# onboardingSupportBody
source: SimplyQibla is ad-free and open-source. If you like what you see, please support us through the in-app links. Your support will be used to run the app, and excess will be donated to registered charities.
ar: سمبلي قبلة خالي من الإعلانات ومفتوح المصدر. إذا أعجبك ما تراه، يرجى دعمنا من خلال الروابط داخل التطبيق. سيتم استخدام دعمك لتشغيل التطبيق، وسيتم التبرع بالفائض للجمعيات الخيرية المسجلة.
de: SimplyQibla ist werbefrei und Open-Source. Wenn Ihnen gefällt, was Sie sehen, unterstützen Sie uns bitte über die In-App-Links. Ihre Unterstützung wird verwendet, um die App zu betreiben, und Überschüsse werden an registrierte Wohltätigkeitsorganisationen gespendet.
fr: SimplyQibla est sans publicité et open-source. Si vous aimez ce que vous voyez, veuillez nous soutenir via les liens dans l'application. Votre soutien servira à faire fonctionner l'application, et les excédents seront donnés à des œuvres caritatives enregistrées.
id: SimplyQibla bebas iklan dan bersumber terbuka. Jika Anda menyukai aplikasi ini, mohon dukung melalui tautan dalam aplikasi. Dukungan Anda akan digunakan untuk menjalankan aplikasi, dan kelebihannya akan disumbangkan ke badan amal terdaftar.
ms: SimplyQibla tiada iklan dan sumber terbuka. Jika anda suka, sila sokong kami melalui pautan dalam aplikasi. Sokongan anda akan digunakan untuk menjalankan aplikasi, dan lebihan akan disumbangkan kepada badan amal berdaftar.
pt_pt: SimplyQibla é livre de anúncios e de código aberto. Se gosta da aplicação, apoie-nos através dos links na aplicação. O seu apoio será usado para manter a aplicação, e os valores excedentes serão doados a instituições de caridade registadas.
